Imports System.Reflection
Imports System.Runtime.CompilerServices
Imports System.Runtime.InteropServices

' General Information about an assembly is controlled through the following
' set of attributes. Change these attribute values to modify the information
' associated with an assembly

' TODO: Review the values of the assembly attributes

<Assembly: AssemblyTitle("Anbar")> 
<Assembly: AssemblyDescription("سيستم انبار")> 
<Assembly: AssemblyCompany("Minoo")> 
<Assembly: AssemblyProduct("Anbar")>
<Assembly: AssemblyCopyright("انبار")>
<Assembly: AssemblyTrademark("Minoo")>
<Assembly: AssemblyCulture("")>





' Version information for an assembly consists of the following four values:

'	Major version
'	Minor Version
'	Revision
'	Build Number

' You can specify all the values or you can default the Revision and Build Numbers
' by using the '*' as shown below
' 2.7.8 890914 حذف کد برای رفع مشکل غیر فعال شدن دکمه جدید و درخواستهای ااقی نیرشادان در مورد درخواست خرید تدارکات 
' 2.8.0 تغییر در فرم انتخاب درخواست در ثبت رسید 


<Assembly: AssemblyVersion("10.10.127")>


'10.9.3 14010724 Dehghani-   تغییرات کارتابل ضایعات
'10.9.1 14010716 Dehghani-   ماژول بارکدخوان
'10.8.1 14010412 Dehghani-   ماژول بارکدخوان

'10.7.4 14001030 Dehghani- تغییرات کارتابل ضایعات 
'10.7.1 14001026 Dehghani- اضافه کردن فرم و گزارش های کارتابل ضایعات 
'10.7.17 14010116 ghasemi- گزارش مغایرت انبارگردانی اول دوره و پایان دوره 


'10.5.36 990506 Rezania- GozareshSamanehJameAnbar 
'10.5.23 971110 Dehghani - FrmAmalkard - تنظیم کانفیگ برای تعیین اینکه گزارش از کدام اس پی برای خواندن اطلاعات استفاده کند - اس پی شرکت های تولیدی با قاسم متفاوت است
'10.5.20 971026 Dehghani - FrmabTafkik_New - تغییر تنظیمات برای استفاده انبار ستاد غذایی از این فرم 
'10.5.19 971010 Dehghani - FrmabSanad - نمایش تاریخ تولید و انقضا برای حواله ها از جدول abKalaphiziki
'10.5.18 971009 Dehghani - ClsWebService - ویرایش متد GetMojoodiForMinooApp (KalaSN As String)
'10.5.17 971008 Dehghani - ClsWebService - اضافه کردن متد GetMojoodiForMinooApp (KalaSN As Decimal)
'10.5.16 970926 Dehghani - FrmabSanad - نمایش تاریخ انقضا برای حواله ها مانند رسیدها 
'10.5.15 970912 Dehghani - FrmabSanad - حذف تراکنش 14 از تراکنش های غیر قابل ویرایش در صورت ماشینی بودن سند 
'10.5.12 970619 Ghafari - Marjooei Sorat
'10.5.11 970305 yekta FrmVaredehMojaz
'10.5.9 960913 1430 Yekta For New DLL 
'10.5.8 960814 change bayegadi botton darkhast position
'10.5.1 960221 Dehghani - ساخت فرم برنامه ریزی ارسال کالا و تعریف کانفیگ برای افزایش سرعت درج اقلام سند
'10.5.0 960109 Filter Factohaye MAjoee by Gahfari
'10.4.74 951216 Yekta for Anbargardani Error
'10.4.73 951209 Ghafari for Anbargardani Error
'10.4.71 951202 Dehghani - List Tafkik Print
'10.4.70 951128 List Tafkik for ghaza  va Daroo
'10.4.69 950620 yekta   افزودن موجودی ریالی به فرم ثبت و بروزآوری تاریخ انقضای کد رهگیری
'10.4.68 950608 Yekta   FrmAbsanad   "AND (T1.IsTajmie <> 1) AND T2.NoeAnbarSN in (5,6)" -- Add 6
'10.4.67 950422 Dehghani Print Label - FrmabSanad
'10.4.66 950229 yekta EnghezaDate 8 digit
'10.4.65 950226 yekta EnghezaDate 8 digit
'10.4.64 950225 yekta EnghezaDate 8 digit
'10.4.63 950207 yekta
'10.4.62 950204 صفر کردن موجودی انبار با تراکنش کسری انبار
'10.4.61 950120 edit by ghafari 
'10.4.57 950110 for show mojodi avaldorehpaikar with avaldore menu
'10.4.56 941121 Yekta   Anbargardani
'10.4.54 941006 Dehghani Add Print Label Button To FrmabSanad
'10.4.53 940908 Ghafari Gozareshe Mpjoodi Sahmiye
'10.4.52 940826 yekta   absanadhachideman
'10.4.51 940817 yekta
'10.4.50 940514 yekta
'10.4.49 940505 Yekta   
'10.4.48 940504 Yekta   Chideman
'10.4.45 940228 Dehghani FrmabDarkhast - Emkan Entekhab Chand Darkhast For Baygani 
'10.4.44 931121 Yekta FrmbSanad 
'10.4.43 931029 Dehghani - Edit Print Label On FrmQC 
'10.4.41.1 930923 Dehghani - Edit BtnDelSelected On  FrmAbSanad  
'10.4.41 930920 Dehghani - Error On Sabt Marjoee - WebService & Edit Send Email On QC
'10.4.40.1 930918 Dehghani - FrmAbSanad Error
'10.4.39.2 930915 Yekta 
'10.4.39.1 930913 Dehghani - Print List Tafkik
'10.4.38.3 930821 yekta
'10.4.36 930818 FrmabSanad  - Error On Sabte Resid - Dehghani
'10.4.35 930817 FrmListTafkik   yekta
'10.4.33 930716 FrmQC - Dehghani - ActiveReport For Creating Labratory Label
'10.4.32 930506 FrmabSanad - Dehghani - Get Properties Of abSanad Form's Objects From DB
'10.4.31 930415 FrmFilterAsnadAnbar.vb yekta
'10.4.30 930327 FemQC  yekta
'10.4.29 930318 FemQC  yekta
'10.4.28 930311 FrmQC - Add FactorNO,DarkhastNO To Email Text Of QC
'10.4.27 930305 FrmSanad 
'10.4.26 930224 CSanad  & FrmFilterAsnadAnbar.vb
'10.4.25 930213 FrmAbAnbar Yekta
'10.4.24 930201 FrmAbDarkhast For Insert Date And Time In SabtDate,TaeedTime,ErsalTime By Dehghani
'10.4.23 930109 FrmQc By Dehghani
'10.4.22 921228 by ghafari for moroortafsilinew with Nerkhgozari Dlls
'10.4.21 921218 FrmRptMojoodiWithEnghezaDate,FrmQC By Dehghani اضافه کردن ستون تامین کننده به فرم گزارش و ثبت تاریخ انقضا,اضافه کردن ارسال ایمیل اتوماتیک در فرم کنترل کیفیت هنگام تغییر تراکنش کنترل کیفیت
'10.4.20 921205 FrmFilterAsnadAnbar اضافه کردن ماهیت کالا به فیلتر اسناد انبار
'10.4.19 921115 FrmRptMojoodWithEnghezadate  اصلاح بچ
'10.4.18 921113 FrmSanad اضافه کردن تراکنش رسيد برگشت از دارائي ثابت مشهود
'10.4.17 921108 FrmSanad
'10.4.16 921017 FrmSanad کنترل مهلت ثبت رسید مرجوعی از توزیع
'10.4.15 921015 FrmSanad اضافه کردن باکس شماره بارنامه به حواله انبار به انبار
'10.4.14 921001 FrmRptQCIntervals
'10.4.13 920926 FrmEslaheSanad
'10.4.12 920920 FrmRptQCIntervals
'10.4.11 920910 FrmRptMojoodWithEnghezadate     
'10.4.10 920826 FrmSanad حذف الزام ثبت فیلد شماره بچ و توضیحات برای ثبت رسید خرید داخلی  
'10.4.9  920826 FrmSanad   کانفیگ اضافه کردن فیلد شماره بچ و توضیحات برای ثبت رسید خرید داخلی برای انبار های مواد اولیه و محصول
'10.4.8  920814 - 920825  FrmSanad & FrmQC اضافه کردن فیلد شماره بچ و توضیحات برای ثبت رسید خرید داخلی و کنترل کیفیت  
'10.4.7  920805 by yekta  FrmSanad -جلوگیری از تغییر شماره ارجاع هنگامیکه اقلام سند از سند مرجع گرفته می شود  
'10.4.6  920722 by yekta  FrmSanad -  btnErsalBeDP_Click  تغییر بابت بارنامه
'10.4.5  920701 by Dehghani - Publishing new version by new DLL files
'10.4.4  920701 by yekta FrmabDarkhast
'10.4.3  920628 by ghafari for Update EnghezaDate service 
'10.4.2  920603 by yekta 
'10.4.1  920509 by yekta FrmabSanad
'10.4.0  920502 by yekta for Anbar.WebService & FrmabSanad & FrmMoroorTafsiliTadil
'10.3.41 920416 by yekta for FrmabSanad  & FrmSelectDarkhast  
'10.3.38 920230 by Yekta
'10.3.37 920228 by Yekta For FrmabSanad  & FrmSelectDarkhast
'10.3.36 920217 by Yekta for Tab SanadHaDarkhast
'10.3.35 920215 by Yekta For FrmShowDarkhast  and abSanadHaDarkhast and add filds ( avarez , maliyat , noekhodro ) to barnameh
'10.3.32 920120 by Ghafari for Enteghal Mojooi To AvalDoreh
'10.3.31 920119 by Ghafari for Problem in Change Date Miladi To Shamsi In QC
'10.3.30 911227 by Ghafari for Anbargardani
'10.3.29 911220 by ghafari add Cpy Moghayerat shomaresh ba mojodi dar shomareshedigar
'10.3.28 911213 by ghafari add easy insert For sabt anbargardani
'10.3.27 911212 add columns in Mojoodi Report [change on the sp]
'               & add NoeBarnameh form [FrmabNoeBarnameh.vb]
'               & add field NoeBarnamehSN [FrmabSanad.vb]
'10.3.25 911028 FrmabAnbar اضافه کردن فیلد ماهیت مالی
'10.3.24 911012 FrmabSanad رفع مشکل دکمه F8
'10.3.23 911011 FrmabSanad - CService - FrmSelectRahgiri رفع مشکل ثبت حواله کاهنده خرید و برگشت از خرید (مشکل شماره درخواست)د
'10.3.22 911010 FrmFilterAsnadAnbar - TAB Kala - رفع مشکل نمایش کالا در فرم فیلتر اسناد
'10.3.21 911004 change frmabSanad for barnameh
'10.3.19 910920 FrmabSanad , dbcTarafHesabSN_Enter , dcbMojavezErsalHa_Enter
'10.3.18 910829 add report [FrmRptHavalehMovaghat.vb]
'18.3.17 910828 use ServiceUserID & ServiceUserPassword
'18.3.16 910719 change for btnErsalBeDP [FrmabSanad.vb]
'10.3.15 910715 some changes for Barnameh [FrmabSanad.vb]
'10.3.14 910705 fix Barnameh for ebtal [FrmabSanad.vb]
'10.3.13 910701 fix mandeh problem [FrmSelectDarkhast.vb]
'10.3.11 910618 fix barnameh [FrmSanad.vb]
'10.3.10 910614 change datacombo to checkedcombobox [frmMasrafeMavad.vb]
'10.3.9 910613: add Masrafe Mavad report [frmMasrafeMavad.vb]
'10.3.8 910523: add barnameh
'10.3.7 910511 : YEKTA - FrmSanad - add gTaminkonandehOzvegoroohForHamleMostaghim to VComboWhereB
'10.3.6 910426 : YEKTA - FrmSanad - FrmabDarkhast غیر فعال کردن شماره درخواست
'10.3.5 910425 : YEKTA - FrmSanad - اصلاح تخصیص هوشمند شماره درخواست به رسید خرید و اصلاح تبدیل تاریخ میلادی به شمسی در رسید  
' و فعال کردن دکمه اصلاح رهگیری در رسید کسری دریافت از شرکت های گروه 
'10.3.4 910414 : add Mojoodi_GhabeleErsal & Mojoodi_TahteBarrasi [FrmabDarkhast.vb]
'10.3.3 910412 : add TaghazaKonandeh [FrmRptSefareshParam.vb]
'10.3.2 910411 : fix control FactorNo in RESIDE_39_MARJOOEI_AZ_TOZIE [FrmabSanad.vb]
'               & fix Noghte Sefaresh Report
'10.3.0 910410 : rename 'تفضیلی' to 'تفصیلی'
'               & control FactorNo in RESIDE_39_MARJOOEI_AZ_TOZIE [FrmabSanad.vb]
'               & add EnghezaDate [FrmMoroorTafsili.vb] & [FrmMoroorTafsiliNew.vb]
'10.2.8 910406 : btnDarkhastErsalAll.Enabled = False [FrmabDarkhast.vb]
'10.2.7 910405 : fix some bugs [FrmabDarkhast.vb]
'10.2.6 910405 : fix some bugs [FrmabDarkhast.vb]
'10.2.5 910404 : درخواست های آقای ملکی در درخواست کالا از انبار
'               & تغییر در هنگام زدن اینتر در ثبت سند انبار
'10.2.3 910322_2 : اضافه شدن شرط وضعیت بررسی نشده در فرم کنترل کیفیت
'10.2.2 910322 : fix some bugs
'10.2.1 910320 : گزارش نقطه سفارش
'10.2.0 910316 : اضافه شدن حواله کاهنده خرید
'10.1.9.0 910227 : تراکنش هايي که نبايد طرف حسابشان تفصيلي خودش نباشد - تفصيلي شعبه يا تفصيلي انبار

'10.1.3 :: نسخه جدید برای جلوگیری از ثبت رسید حمل مستقیم برای شرکتهای گروه در شعب قاسم

' 2.39 به خاطر طرف حساب در برخي حالتها فرم سند 
' 2.41 اضافه شدن تبديل تاريخ در کنترل کيفيت
' 2.42 اضافه شدن فرم رويه رهگيري کالا در انبار + اصلاح فرم سند در رابطه با شماره رهگيري
' 2.44 بنابدرخواست جديد آقايان صوري و پيرنيا موقت و قطعي يکسان شد اگر کسي قطعي کرد بشود
' 2.45 اصلاح برنامه براي کارتن عدد در هنگام وارد شدن مانند سابق گردد 
' 2.46 حذف طرف حساب دوم در کليه اسناد انبار
' 2.47 اضافه شدن اصلاحيه سند انبار 
' 2.49 اصلاح منو و فرم کنترل کيفيت + پنهان کردن ستون نوع رهگيري
' 2.50 اصلاحات نهايي رسيد و حواله برگشتي           +   رسيد و حواله انبار به انبار طرف حساب دار شد 
' 2.51 اضافه شدن فيلد تعداد ظرف در اقلام سند 
' 2.52 اضافه شدن تراکنش جديد 85    83/09/25
' 2.55 نسخه جديد NetSql
' Ver 2.56 هنگام اصلاح طرف حساب مشکل داشت
' 2.57 تکميل گزارش کاردکس
' 2.58 نمايش کليد چاپ گزارش موجودي و تفصيلي
' 2.60 اصلاحات فايل خروجي انبار 
' 2.61 اصلاح عناوين براي انبار محصول  جهت استفاده در شعب
' 2.64  اصلاحات بعلت نوع ورود اسناد فيلد مورد نظر را DVدرست نمي آورد
' 2.65 اصلاحات ورود اطلاعات براي درست کردن فايل خروجي انبار
' 2.66 اصلاح برنامه براي کنترل مهلت ورود به ازائ تک تک تراکنش هاي هر انبار  نوع انبار 
' 83/10/20 2.67 مشکل گزارش کاردکس
' 83/10/20 2.69 اضافه شدن کنترل روي فيلدهاي عددي براي ورود اطلاعات شعب
' 83/10/21 2.71 گزارش چاپ اسناد در گزارشات و در فرم ورود اطلاعات اسناد
' 83/10/21 2.72  در گزارش موجودي انبار از تاريخ برداشته شد
' 83/10/23 PM 2.73 گزارش عملکرد انبار اضافه شد
' 83/10/24 12:23 2.73 اصلاحات در مورد نوع انبار در تراکنشهاي هر انبار
' 83/10/24 14:12 2.74  در انبارهاي تجميع همه کالاها و در انبارهاي غيرتجميع کالاهاي آن انبار خاص در فيلتر گزارشات
' 83/10/28 12:55 2.75 گزارش رزرو اضافه شد
' 83/10/28 15:46 2.76 اصلاح با احتساب به محاسبه در گزارشات آقاي صبوري
'                    +  کنترل وجود شاخه و مسير براي تهيه فايل خروجي
' 83/10/29 10:56 2.77 اصلاح برنامه حذف کليه اسناد هر انبار
' 83/11/03 2.79 ...
' 83/11/04 2.80 اصلاح برنامه خواندن فايل اسناد انبار
' 83/11/06 2.81 اصلاح گزارش عملکرد انبار  کالاهاي گردش دار بله خير
' 83/11/06 2.82 اصلاح گزارش عملکرد   اشتباه در مورد وارده - صادره 
' 83/11/11 2.83 ارسال حواله ضايعات به انبار ضايعات
' 83/11/13 2.84 اضافه شدن کليد اف 8 در ورود اطلاعات حواله ها 
' 83/11/14 2.85 اصلاح شرح برخي ستون ها در فرم سند
' 83/11/15 2.86 اصلاح برنامه
' 83/11/18 2.87 انبار و نوع انبار پنهان گردد 
' 83/11/21 2.88 نسخه جديد کتابخانه
' 83/11/27 2.89 نسخه جديد کتابخانه
' 83/12/20 2.90 نسخه جديد کتابخانه
' 84/01/22 2.91 اصلاح هشدار کالاهاي بدون نرخ استاندارد
' 84/01/22 2.92 نسخه جديد کتابخانه
' 84/01/27 2.94 اصلاح تراکنش 31 و اضافه شدن 42 برابر نامه 115-33پ     & QCOK 
' 84/01/29 2.95 اضافه شدن کمک در اصلاح نوع مرجوعي در رسيدهاي مرجوعي دار
' 84/01/30 2.96 در تراکنش هاي هر انبار امکان بدون تاييد کنترل کيفيت + اصلاح برنامه انبار
' 84/02/03 2.97 ‌آخرين نسخه
' 84/02/04 2.98 اضافه شدن تراکنش 11 آقاي صبوري در اصفهان
' 84/02/05 2.99 اصلاح برنامه در مورد چاپ سند 
' 84/02/05 3.00 اضافه شدن کليد اکسل در سند
' 84/02/07 3.01 نسخه جديد کتابخانه
' 84/02/07 3.02 اصلاح گزارش موجودي انبار
' 84/02/09 3.03 اصلاح گزارش موجودي انبار
' 84/02/09 3.04 حذف طرف حساب از رسيد حمل مستقيم   صبوري در اصفهان     + حذف خطوط برنامه مخصوص فايل مين فريم
' 84/02/10 3.06 اصلاحات در مورد گزارش ريالي موجودي 
' 84/02/11 3.07 اصلاحات در مورد گزارش ريالي تفصيلي 
' 84/02/11 3.08 اصلاحات در فرم هشدار کالاهاي بدون نرخ
' 84/02/13 3.09 اصلاح شماره ماشين به غير عددي + رفع مشکل رزرو کالا
' 84/02/14 3.10 اصلاح گزارش ريالي براي فيلتر 
' 84/02/14 3.11 اصلاح فرم سند براي نام راننده غير عددي گردد
' 84/02/17 3.12  اصلاحات برنامه براي اضافه شدن فيلتر کالا به گزارشات
' 84/02/17 3.13 اصلاحات در فيلتر گزارشات براي از کالا تا کالا 
' 84/02/18 3.14 اتمام يکسان سازي و فيلتر کالا روي گزارشات انبار 
' 84/02/19 3.15  اصلاحات براي استفاده از فيلتر
' 84/02/21 3.16 عريض شدن کامبو طرف حساب
' 84/02/21 3.17 عريض شدن کامبو طرف حساب
' 84/02/25 3.18 اصلاحات در مورد مرجوعي از فروش
' 84/02/26 3.19 اصلاح در مورد فيلتر انبارهاي پاي کار
' 84/02/28 3.20 اصلاح فرم کنترل کيفيت براي قسمت مشاهده اسناد + اصلاح فيلتر انبار به انبار ها فقط انبار همان واحد تجاري
' 84/02/31 3.21 اصلاحات برنامه در مورد منوهاي اضافي
' 84/03/01 3.22 اصلاح فرم کالاهاي هر انبار
' 84/03/04 3.23 اصلاحات در مورد اصلاحيه اسناد   و بستن اصلاحيه از 38  و  39 فقط اصلاح داشته باشد
' 84/03/05 3.24 اصلاحات فرم سند 
' 84/03/08 3.25 جدا شدن کلاس سند از پروژه انبار
' 84/03/23 3.26 اضافه شدن تکرار کارت شناسايي در رويه رهگيري انبار
'                برابر نياز پيش آمده در انبار هاي پارس اين ستون جديد اضافه شد
' 84/02/07 3.27 نسخه جديد کتابخانه
' 84/03/29 3.28 اصلاح نام اس پي کنترلي برنامه
' 84/03/29 3.29 نسخه جديد کتابخانه
' 84/03/31 3.30 اصلاحات گزارشات براي فيلتر
' 84/04/02 3.31 اصلاحات در مورد ريال واقعي
' 84/04/02 3.32 اصلاحات در مورد ريال واقعي
' 84/04/04 3.33 اضافه شدن ثبت ريال واقعي در تراکنش هاي هر انبار
' 84/04/04 3.34 اصلاحات در فرم ثبت ريال واقعي
' 84/04/04 3.34 اضافه شدن گزارش کنترل کاردکس
' 84/04/08 3.35 حذف ÷يغام در فرم کنترل کيفيت در مشهد
' 84/04/08 3.36 اصلاحات در هنگام قطعي کردن قيمت گذاري واقعي
'               قيمت گذاري واقعي در هنگام کنترل ناقص است بايد تکليف هزينه واقعي مشخص گردد
' 84/04/13 3.37 اضافه شدن گزارش مرور تفصيلي ريالي جديد و مرور سند انبار ريالي
' 84/04/13 3.38 اصلاح گزارش عملکرد
' 84/04/13 3.39 نسخه جديد کتابخانه اصلاحات برنامه 
' 84/04/20 3.40 نسخه جديد کتابخانه اصلاحات برنامه      4.3.1.4
' 84/04/21 4.1 اصلاحات برنامه براي استفاده از      BaseApplication
' 84/04/21 4.2 اضافه شدن ورود اسناد انبار با کد کالا 9 رقمي 
' 84/04/22 4.3 نسخه جديد کتابخانه اصلاحات برنامه      4.3.2.0
' 84/04/26 4.4 اضافه شدن اضافي و کسري انبار
' 84/04/28 4.5 آخرين نسخه
' 84/04/28 4.6 آخرين نسخه
' 84/04/31 4.7 اصلاحات نمايش تراکنش ها در اسناد انبار
' 84/05/20 4.8  ‌اصلاح فيلتر تراکنش
' 84/05/02 4.9 نسخه جديد کتابخانه اصلاحات برنامه      4.3.2.1
' 84/05/03 4.10  در کالاهاي هر انبار کالاهاي غير فعال نمي آيد
' 84/05/03 4.11 اضافه شدن کليد حذف انتخابي در اقلام سند
' 84/05/04 4.12 بستن کليد حذف انتخابي در رسيد مرجوعي از فروش و توزيع
' 84/05/08 4.14 کليه مولفه هاي سيستم جدا شده است 
' 84/05/09 4.15 Edit Sanad
' 84/05/16 4.16 Edit Sanad
' 84/05/18 4.17 Edit Sanad
' 84/05/19 4.18 Edit Peykarbandi 
' 84/05/19 4.19 Edit Sanad
' 84/05/23 4.20 Last
' 84/05/24 4.21 Edit AnbarGardani
' 84/05/25 4.22 اضافه شدن تراکنش 92
' 84/05/31 4.23  اصلاحات در مورد انتخاب واحد تجاري   +  Edit Sanad
' 84/06/02 4.24 اصلاحات در مورد فيلتر انبار
' 84/06/03 4.25 Edit RialiReport
' 84/68/05 4.26 نسخه جديد کتابخانه قطعه
' 84/06/06 4.27 اصلاح گزارش موجودي براي فيلتر    +      شماره رهگيري در فيلتر 
' 84/06/08 4.28 Edit MeghdariReport
' 84/06/09 4.29 Edit Sanad
' 84/06/10 4.30 Edit MeghdariReport
' 84/06/19 4.31 Edit MeghdariReport
' 84/06/22 4.32 Edit Sanad
' 84/06/27 4.33 Edit Meghdri report & Hesabdari
' 84/07/03 4.34 Edit MeghdariReport
' 84/07/03 4.35 نسخه جديد کتابخانه   	
' 84/07/10 4.36 Edit Chideman
' 84/07/13 4.37 نسخه جديد کتابخانه   	
' 84/07/20 4.38 Edit Meghdari & Riali Reports
' 84/07/21 4.39 Edit Riali Reports
' 84/07/24 4.40 Edit Hesabdari
' 84/08/02 4.41 Edit Sanad
' 84/08/10 4.42 Edit Sanad
' 84/08/17 4.43 Edit Sanad
' From IT MINOO
' 84/08/17 4.44 نسخه جديد کتابخانه & تکميل فيلتر گزارش طرف حساب
' 84/09/20 4.46 حذف منابع اضافي در تمام قطعات سيستم
' 84/09/30 4.47 اصلاحات مربوط به اس.پي.هاي يونيت سرويس هاي انبار
' 84/10/06 4.48 گزارشات نگاشت 
' From IT MINOO 1384/10/19 1409
' 84/10/20 4.49 SMGH Edit Ab.Common & Ab.MeghdariReport & Ab.RialiReport & Ab.Hesabdari
' 84/11/10 4.50 DLL Expire
' 84/11/17 4.51 عدم امکان صدور اصلاحي براي سند اول دوره
' 84/11/29 4.52 گزارش عملکرد ريالي
' 84/12/03 4.53 اصلاح گزارش عملکرد، اصلاحات در انبارگرداني
' 84/12/07 4.54 گردش كالا به تفكيك طرف حساب ريالي
'               DLL Expire & Change FriendsTeam namespace to Minoo
' 84/12/09 4.55 تغيير در تگ انبارگرداني
' 84/12/09 4.56 رفع باگ برنامه
' 84/12/09 4.57 تگ انبارگرداني جديد
' 84/12/11 4.58 تغيير در تگ انبارگرداني
' 84/12/13 4.59 Report DLL
' 84/12/14 4.60 اضافه شدن طرف حساب به رسيد حمل مستقيم
'               رفع باگ گزارشات در انبار تجميع                
'               تکميل شروط کالا فيلتر اسناد
' 84/12/21 4.61 اضافه شدن ثبت کننده به ستونهاي گزارش مرور تفصیلی
'               تغيير در گزارش عملکرد ريالي
' 84/12/21 4.62 رفع اشکال در گزارش مرور تفصیلی
'               اضافه شدن ستون‌هاي کارتن و بسته در گزارش سرجمع موجودي
'               اضافه شدن محل چيدمان در گزارش مغايرت انبارگرداني

'''             اضافه شدن محل چيدمان در گزارش مغايرت مابين شمارش انبارگرداني
''' 

' 84/12/24 4.63,4 اضافه شدن برخي ستونها  و شروط گزارش در عملکرد ريالي انبار
'               اضافه شدن ستونهاي ريالي به گزارشات نگاشت
'               تغييرات در گزارش مرور ريالي اسناد
''               اضافه شدن تازه هاي سيستم
' 84/01/05 4.65 امکان درح تک رديف در ثبت شمارش هاي انبارگرداني
'               اضافه شدن تيک مربوط به اصلاحيه هاي تراکنشهاي انتخاب شدن در گزارش مرور اسناد  و عملکرد ريالي
'               تغيير در گزارش مغايرت انبارگرداني
'               تغيير در گزارش مرور ريالي اسناد انبار
'               رفع اشکال موجود در گزارش عملکرد ريالي
'               اضافه شدن يک گزارش به گزارشات نگاشت
' 84/01/16 4.66 تغيير در گزارش عملکرد
'               تغيير در گزارش مرجوعي سالم و فاسد
' 85/01/20 4.67 اضافه شدن فيلتر تراکنش به گزارش تفصیلی و مرور اسناد
' 85/01/22      رفع اشکال چاپهاي با سايز کاغذ سفارشي
' 85/01/22      تغيير در شرط کومبو تراکنشها جهت نمايش تراکنشهاي غيرفعال استفاده شده 
' 85/01/22      بررسي و پالايش فرمت سرجمع تمام گزارشات
' 85/01/23      اضافه شدن برخي فيلترها به گزارش مرجوعي سالم و فاسد
' 85/01/30 4.68 اضافه شدن فيلتر نوع ضايعات در گزارش مرور تفصیلی و سرجمع
' 85/02/02 4.69 اضافه شدن کليد چيدمان در گزارش موجودي
' 85/02/11 4.70 اضافه شدن انواع شروط کالا به فيلتر کالا در فيلتر اسناد انبار
' 85/02/17      تکرار عناوين ستونها در تمام صفحات در گزارش کاردکس
' 85/02/17      اضافه شدن تازه هاي سيستم 
' 85/02/20 4.71 رفع اشکال در محاسبه اول دوره در گزارش عملکرد
' 85/02/21      تغيير در نحوه محاسبه آخرين نرخ استاندارد در گزارش عملکرد
' 85/02/24 4.72 اضافه شدن امکان کپي حواله هاي انبار به انبار به انبارهاي محصول و ضايعات
' 85/02/25      نمايش و ذخيره مشتري به عنوان طرف حساب در رسيد مرجوعي از فروش و توزيع
' 85/02/26      ايجاد رفتار مشابه انبار هاي محصول براي انبار مرجوعي در تمامي سيستم
' 85/02/31 4.73 حذف ستونهاي مربوط به نگاشت از گزارشات عملکرد و مرور اسناد ريالي
' 85/03/01      اضافه شدن شماره فاکتور در چاپ رسيد مرجوعي از توزيع
' 85/03/02      اعمال تغييرات مورد نياز در گزارشات نگاشت در خصوص تغييرات سيستم نگاشت
' 85/03/03      اضافه شدن فيلتر نوع مرجوعي در گزارش مرور تفصیلی و سرجمع
' 85/03/03 4.74 امکان اضافه و حذف در ويرايش رديف اسناد رسيد مرجوعي از فروش و اصلاحي آن
' 85/04/06 4.75 اضافه شدن گزارش نقطه سفارش
' 85/05/05 4.76 اصلاح فيلتر کالا
' 85/05/05      ايجاد رفتار مشابه با انبار محصول و ضايعات محصول براي انبار مرجوعي
' 85/05/07      اضافه کردن تعاريف مورد نياز تراکنش جديد حواله ارسال به صادرات
' 85/05/07      اضافه کردن تعاريف مورد نياز تراکنش جديد حواله دارائي ثابت مشهود
' 85/05/08 4.77 اضافه کردن تگ انبارگرداني قاسم
' 85/05/11      تغيير فرمت وارده ، صادره کاردکس
' 85/05/15      رفع اشکال درج تک شمارش
' 85/05/18 4.78 اضافه کردن گزارش تگ انبارگرداني
' 85/05/22 4.79 اضافه شدن حالات کنترل کاردکس
' 85/05/22 4.80 تغييرات درخواستي انبارگرداني
' 85/05/28 4.81 رفع ايراد ثبت اول دوره
' 85/05/31 4.82 تغيير در فيلتر گزارش نقطه سفارش
' 85/06/06 4.83 معکوس کردن ترتيب نمايش شماره هاي فاکتور در شماره ارجاع مرجوعي از فروش
' 85/06/19      تغيير در گزارش مغايرت انبارگرداني
' 85/06/22 4.84 امکان اصلاح اسناد اصلاحي مربوط به اصلاح طرف حساب
' 85/06/22      امکان اصلاح مجدد اسنادي که اصلاح طرف حساب شده اند
' 85/07/01      اضافه شدن فيلتر وضعيت اموالي
' 85/07/03      اضافه شدن آيتم هاي بررسي نشده و مصرف اضطراري در فيلتر کنترل کيفيت
' 85/07/04      اضافه شدن فرم مشاهده اسناد اصلاحي سندهاي انتخاب شده
' 85/07/04      اضافه شدن فيلتر اسناد تسويه شده و نشده در فرم ريال واقعي
' 85/07/05      امکان درج کد رهگيري غيرعددي
' 85/07/09 4.85 رفع خطاي کد رهگيري در انبارهاي داراي کد رهگيري غير يک
' 85/07/12 4.86 حذف ستون آخرين نرخ استاندارد فعلي از گزارش عملکرد ريالي
' 85/07/22      فعال سازي ليست شماره رهگيري ها در رسيدها
' 85/07/22      اضافه کردن تعداد در کارتن، کارتن و عدد در ليست شماره رهگيري ها
' 85/07/26      اضافه کردن واحد سنجش به کالاهاي هر انبار
' 85/07/27      رند به بالا ريال استاندارد و هزينه استاندارد در اس.پي مربوطه
' 85/07/27      حذف نمايش اعشاري ريال ها و جلوگيري از درج ريال واقعي اعشار دار در فرم ريال واقعي
' 85/07/28      اضافه شدن گزارش تسهيم انحراف
' 85/07/29      اضافه کردن حواله مصرف شرکت هاي گروه 
' 85/07/30      اضافه شدن حالات کنترل وجود نرخ استاندارد
' 85/07/30      اضافه شدن حالات کنترل صدور اسناد مالي
' 85/07/30      اضافه شدن حالات کنترل نرخ گذاري استاندارد اسناد انبار
' 85/07/30 4.87 اضافه شدن حالات کنترل توالي قطعي سازي اسناد
' 85/08/06       اضافه شدن فيلتر چيدمان کالا
' 85/08/07       اضافه شدن فيلتر چيدمان کالا به گزارش موجودي
' 85/08/07       اضافه شدن فيلتر چيدمان کالا به گزارش نقطه سفارش
' 85/08/21 4.88 اضافه کردن حواله براي توزيع حمل مستقيم
' 85/09/13 4.89 اضافه کردن فليد تاريخ ثبت
' 85/09/16      اضافه شدن گزارش تسهيم انحراف شعب
' 85/09/19 4.90 اضافه شدن فليد نوع سند
' 85/09/19      جلوگيري از تفيير اسناد با نوع ماشيني تغيير ناپذير
' 85/09/22      ذخيره سازي تاريخ قطعي سازي سند
' 85/09/22      اضافه شدن فرم مشاهده مشخصات اسناد انتخاب شده
' 85/09/22      Add abSanad new fields in Services
' 85/09/25      اضافه شدن گزارش ليست کاردکس کالا
' 85/09/27      اضافه شدن فيلدهاي جديد در گزارش مرور اسناد
' 85/09/27      اضافه شدن فيلدهاي جديد در گزارش مرور تفصيلي اسناد
' 85/09/27      نمايش گردش کالاهاي فاقد طرف حساب در گزراش گردش کالا به تفکيک طرف حساب
' 85/09/27      نمايش گردش کالاهاي فاقد طرف حساب در گزراش گردش کالا به تفکيک طرف حساب ريالي
' 85/09/27      امکان چاپ سند به ترتيب کد کالا
' 85/10/04      فرم جديد بروزآوري تاريخ اسناد پيشنويس و موقت
' 85/12/01 4.91 اضافه شدن نوع سند به اسناد انبار شامل اسناد دستي، ماشيني تغيير پذير و ماشيني تغيير ناپذير
'	              جلوگيري از تغيير اسناد با نوع ماشيني تغيير ناپذير
'	              ذخيره‌سازي تاريخ قطعي‌سازي سند
'	              امکان مشاهده مشخصات اسناد انتخاب شده
'	              گزارش جديد ليست کاردکس کالا
'	              نمايش اطلاعات تکميلي اسناد در گزارش مرور اسناد
'	              نمايش اطلاعات تکميلي اسناد در گزارش مرور تفصيلي اسناد
'	              نمايش گردش کالاهاي فاقد طرف حساب در گزراش گردش کالا به تفکيک طرف حساب تعدادي و ريالي
'	              امکان چاپ سند به ترتيب کد کالا و يا ترتيب درج آن
'	              امکان بروزآوري تاريخ اسناد پيشنويس و موقت به آخرين تاريخ قطعي اسناد
'	              اضافه شدن حواله ارسال ملزومات و قطعات به پروژه در دست تکميل
'	              اضافه شدن رسيد مرجوعي از فروش محصول شرکتهاي توليدي  
'	              اضافه شدن امکان درج دسته اي کالا فيزيکي به رديف اسناد انبار
'	              اضافه شدن امکان انتخاب کالا فيزيکي با توجه به تعداد و ترتيب درخواستي

' 85/12/05 4.92 اضافه شدن گزارش جديد موجودي با دو حالت با فيلتر و بدون فيلتر با زمان بهينه
'	85/12/05      اضافه شدن فيلتر چيدمان به گزارش مرور تفصيلي
' 85/12/05      اضافه کردن کليد تخصيص تکراري در فرم تخصيص کالا به چيدمان
' 85/12/05      امکان درج قيمت واقعي با طول عدد بزگتر از  9

'85/12/08 4.93 افزودن فيلتر تاريخ ثبت سند به فرم فيلتر اسناد انبار
'85/12/08      افزودن فيلتر تاريخ ثبت سند به گزارش عملکرد انبار
'85/12/08      افزودن فيلتر تاريخ ثبت سند به گزارش سرجمع موجودي انبار
'85/12/08      افزودن فيلتر تاريخ ثبت سند به گزارش مرور تفصیلی اسناد انبار
'85/12/08      افزودن فيلتر تاريخ ثبت سند به گزارش گردش کالا به تفکيک طرف حساب
'85/12/08      افزودن شماره رهگيري-نام شرکت-محل کالا به تگ الصاق و سرت بر اساس محل چيدمان
'85/12/20 4.93  افزودن تاريخ قطعي سازي به فرم رسيد و حواله
'85/12/22 4.93 بهينه سازي ثبت شمارش هاي انبارگرداني
'85/12/26 4.93 اصلاح ظاهر فرم فيلتر اسناد
'86/01/18 4.93   کليد F8 در درج سند رفع مشکل 
'86/01/25 4.94 تغيير گزارش کالاهاي بدون نرخ از حالت ويو به اس پي و افزودن فيلتر تاريخ و انبار به آن
'86/01/25 4.94 تغيير فرم ثبت سند کسري اضافه براي محدود کردن کاربر براي درج سند کسري اضافه در سالي که انبارگرداني صورت گرفته است
'86/03/19 5.0.0 اصلاح عملکرد کليد F8 براي درج کالاهاي انتخاب شده توسط کاربر
'86/03/19 5.0.0 اصلاح عملکرد کليدفعال کردن کليد F9 براي درج کالا فيزيکي ها به ترتيب تاريخ ورود به انبار
'86/04/20 Reset Version To 1.0.0
'86/04/20 1.0.0 بهينه سازي روال ثبت اقلام رسيد و حواله
'86/04/20 1.0.0 رفع خطاي گزارش عملکرد ريالي انبار و گزارش مرور ريالي اسناد انبار براي درنظر گرفتن کد معين بعناون عدد
'86/04/20 1.0.0  تغيير عنوان کد رهگيري بر اساس نوع رويه رهگيري در فرم سند
'86/04/20 1.0.0 عدم تکرار کد رهگيري براي يک فروشنده خاص و يک کالاي خاص در روزهاي مختلف
'86/04/24 1.0.0 افزودن تراکنش حواله صادرات/رازقي
'86/04/31 1.1.0 تغيير رويه رهگيري بر اساس کالاي انبار
'86/04/31 1.1.0 افزودن فيلد تاريخ توليد و انقضا روي اسناد انبار
'86/04/31 1.1.0 بروزرساني تاريخ توليد و انقضاي موجود در سند در زمان ويرايش تاريخ توليد و انقضا موجود در کالافيزيکي
'86/05/07 1.2.0 تغيير اس پي قطعي سازي و حذف تراکنش هاي داخل اس پي و استفاده ار تراکنش در برنامه
'86/06/21 1.2.0 تغيير ثبت موجودي اول دوره به انتقال موجودي اول دوره و اضافه کردن دو جدول مياني و امکان تفکيک کد رهگيري موجودي اول دوره
'86/05/28 1.2.1 رفع خطاي تگ در عدم ريست شدن شماره رديف
'86/05/28 1.2.2 افزودن تاريخ توليد و انقضا به جدول سند اول دوره
'86/06/12 1.2.3 افزودن امکان اصلاح کد هگيري رسيدها
'86/06/12 1.2.3 عدم امکان انتخاب طرف حساب در حواله کاذب
'86/06/12 1.2.3 گزارش موجودي انبار به تفکيک رهگيري
'86/06/13 1.2.3 راه اندازي کليد اف 10و11براي خروج بر اساس تاريخ توليد و انقضا
'86/02/12 1.2.3 اصلاح ثبت مقدار صادره و وارده به NULL در صورت صفر بودن
'86/02/12 1.2.3 سرت شماره فاکتورها بر اساس تاريخ صدور
'86/06/26 1.3.0 تغيير رسيد مرجوعي از توزيع بر اساس فاکتور
'86/06/26 1.3.0 عدم امکان انتخاب کد رهگيري صفر
'86/07/15 1.3.1 امکان ويرايش تاريخ انقضا در رسيدهاي قطعي
'86/07/23 1.4.0 حذف ستونهاي انبار ونوع انباراز جدول کالافيزيکي و امکان محاسبه بهاي تمام شده
'86/08/13 1.4.1 تغيير فرم کنترل کيفيت بر اساس انبار
'86/09/18 1.4.3 تغيير انبارگرداني بر اساس ساختار جدول کالافيزيکي و محاسبه بها در سند اول دوره
'86/10/11 1.4.4 افزودن گزارش کنترل اسناد بين شعب-حواله تحويل به شرکتهاي گروه
'86/10/20 1.4.4 افزودن امکان صدور اتوماتيک حواله فروش در فرم انبار و تغيير در اس پي قطعي سازي سند انبار
'86/10/23 1.4.5 افزودن دو تراکنش حواله برگشت محصول به پايکار و رسيد برگشت مواد از پاي کار
'86/11/03 1.4.6 افزودن گزارش کالاهاي کمتر از حداقل موجودي
'86/12/11 1.4.7 افزودن تگ انبارگرداني پارس براي شماره رهگيري
'86/12/11 1.4.7 افزودن گزارش ليست کاردکس کالا
'86/12/15 1.4.7 افزودن ستون شماره رهگيري به فرم ثبت شمارش ها
'86/12/21 1.4.8 افزودن تعداد اجزا و واحد سنجش به گزارش مغايرت انبارگرداني و مغايرت ما بين شمارش ها
'87/01/24 1.5.1 اصلاح فرم تفکيک رهگيري در صورتي که انتقال داده نشده باشد اطلاعات پايين هم نمايش داده نشود
'87/01/31 1.5.2 افزودن IsRes4 براي صدور شماره سند بصورت فرمت جديد
'87/02/01 1.5.2 تغيير حواله ضايعات براي طرف حساب که صرفا انبار ضايعات انتخاب شود
'87/08/09 1.6.0 افزودن امکان تجميع بر اساس واحد تجاري - افزودن فيلتر شماره ارجاع-بارنامه به گزارش مرور تفصیلی و مرور تفصیلی ريالي
'87/02/22 1.7.0 افزودن درخواست کالا از انبار
'87/02/30 1.7.1 افزودن امکان اصلاخ اطلاعات سند-افزودن تراکنش هاي رسيد خريد داخلي ملزومات و رسيد مرجوعي ا فروش محصول بدون شماره ارجاع
'87/03/25 1.7.2 افزودن تراکنش 26و70-رسيد انباربه انبار بين واحدها و حواله انبار به انبار بين واحدها جهت تجميع شرکتهاي پارس
'87/04/15 1.8.0 تصحيح نمايش گزارش عملکرد انبار-کنترل موجودي انبار پايکار در هنگام ثبت رسيد برگشت مواد از پايکار-حواله انبار به انبار مواد و ثبت اتوماتيک رسيد مربوطه
'87/05/13 1.9.0 تغيير تگ قاسم-تغيير گزارش چاپ تگ انبارگرداني- تغيير گزارش عملکرد انبار
'87/06/03 2.0.0 افزودن تراکنش هاي 32و17و23
'87/06/11 2.0.1 افزودن تراکنش 21و73
'87/06/16 2.0.2 تغيير اصلاحيه ها و اصلاح طرف حساب براي سال مالي جاري و انجام يکبار
'87/06/23 2.0.3 افزودن حواله مصرف لوازم يدکي
'87/06/24 2.0.3 افزودن شماره ارجاع راي رسيد مرجوعي بدون شماره ارجاع
'87/07/09 2.0.4 تغيير ويوي گزارش عملکرد ريالي براي مشکل روند-افزودن امکان اصلاح شماره سفارش-افزودن تراکنش 49
'87/07/28 2.0.5 رسيد مرجوعي از توزيع-مشکل سرعت
'87/08/07 2.0.6 افزودن تراکنش هاي 
'حواله ارسال لوازم تعمير ونگهداري ماشين آلات 
'حواله ارسال لوازم تعمير ونگهداري تاسيسات
'حواله ارسال البسه وپوشاک
'حواله ارسال اقلام بهداشتي ودرماني
'حواله ارسال اقلام آبدارخانه
'حواله ارسال مصالح ساختماني 
'حواله ارسال لوازم کپي وتکثير
'حواله ارسال کالاي فرهنگي وهنري 
'حواله ارسال ملزومات ونوشت افزار
'حواله ارسال ابزار مصرفي 
'حواله ارسال تنظيفات مصرفي 
'87/08/27 افزودن ستون مبالغ ريالي واقعي صادره و وارده در گزارش مرور تفصیلی ريالي
'87/09/10 افزودن تراکنش رسيد دريافت مواد نيم ساخته از پاي کار
'87/09/24 افزودن تراکنش حواله فروش از پايکار-امکان دستي يا سيستمي بودن تراکنش هاي انبار
'87/11/06 بازنويسي گزارشات انبار و ادغام گزارشات ريالي و تعدادي و استفاده از janus
'87/12/03 تگ انبار گرداني خرمدره و تغيير گزارش صورتجلسه انبارگرداني بر اساس فرمت جديد شماره سند
'87/12/11 افزودن فيلتر تاريخ ثبت به گزارشهاي مررر تفصیلی و عملکرد
'87/12/14 امکان درج آسان شمارش ها
'88/01/29 بهينه سازي گزارش نگاشت اسناد انبار
'88/02/05 بهينه سازي گزارشات انبار
'88/06/10 امکان صدور حواله به شعب
'88/06/23 امکان اصلاح رهگيري روي اسناد ماشيني
'88/07/29 درخواست کالا از انبار و گزارش آن
'88/08/04 رفع خطاي گزارش عملکرد
'88/08/12 عدم امکان اصلاحيه و اصلاح طرف حساب روي اسناد ماشيني-امکان اصلاح اسناد ماشيني صادره از درخواست کالا-رفع مشکل تغيير مشخصات سند بين شعب
'88/09/21 اصلاح طرف حساب 2
'88/10/22 نسخه 2008 2.5.0
'89/01/24 2.5.3 امکان تغییر انبار در خواست کالا از انبار
'89/02/18 2.5.5  تغییر فرمت چاپ پارس گستر
'89/03/16 2.5.8 چاپ درخواست
'89/04/20 2.5.9 ارتباط انبارهای خرمدره و قاسم
'89/05/10 2.6.0 برگشت از درخواست خرید
'89/05/23 2.6.1 اصلاح مشکل transaction در فرم سند
'89/05/23 2.6.2 شماره بارنامه در حواله تحویل به شرکتهای گروه
'1400/08/13 10.6.10 تغییر طرف حساب تراکنش 26
